{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "model_type": "encoder-decoder",
  "encoder": {
    "model_type": "bert",
    "name_or_path": "indobenchmark/indobert-base-p2",
    "hidden_size": 768,
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "intermediate_size": 3072
  },
  "decoder": {
    "model_type": "bert",
    "name_or_path": "indobenchmark/indobert-base-p2",
    "is_decoder": true,
    "add_cross_attention": true,
    "hidden_size": 768,
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "intermediate_size": 3072
  },
  "tie_encoder_decoder": true,
  "max_position_embeddings": 512,
  "vocab_size": 50000,
  "bos_token_id": 101,
  "eos_token_id": 102,
  "pad_token_id": 0,
  "transformers_version": "4.45.0"
}
